# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [2]:
# Your code here
cur.execute('''SELECT lastName, firstName, city, state
            FROM offices JOIN employees 
            USING (officeCode) 
            ORDER BY firstName, lastName;''')
df = pd.DataFrame(cur.fetchall())
df.columns = ['lastName', 'firstName', 'city', 'state']
df.head()

  lastName firstName           city state
0   Fixter      Andy         Sydney
1      Bow   Anthony  San Francisco    CA
2    Jones     Barry         London
3   Murphy     Diane  San Francisco    CA
4    Tseng  Foon Yue            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [3]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
                FROM orders JOIN customers
                ON (orders.customerNumber=customers.customerNumber)
                ORDER BY contactFirstName, contactLastName;''')
df = pd.DataFrame(cur.fetchall())
df.columns = ['contactFirstName', 'contactLastName', 'orderNumber', 'orderDate', 'status']
df.head()

  contactFirstName contactLastName  orderNumber   orderDate      status
0           Adrian          Huxley        10139  2003-07-16     Shipped
1           Adrian          Huxley        10270  2004-07-19     Shipped
2           Adrian          Huxley        10361  2004-12-17     Shipped
3           Adrian          Huxley        10420  2005-05-29  In Process
4            Akiko       Shimamura        10258  2004-06-15     Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [4]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, paymentDate, amount
                FROM payments JOIN customers
                USING (customerNumber)
                ORDER BY contactFirstName, contactLastName;''')
df = pd.DataFrame(cur.fetchall())
df.columns = ['contactFirstName', 'contactLastName', 'paymentDate', 'amount']
df.head()

  contactFirstName contactLastName paymentDate    amount
0           Adrian          Huxley  2003-08-03  24013.52
1           Adrian          Huxley  2004-08-02  35806.73
2           Adrian          Huxley  2005-01-03  31835.36
3            Akiko       Shimamura  2005-02-14  33967.73
4            Akiko       Shimamura  2004-06-21  22037.91

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [5]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, productName, quantityinStock, orderDate
                FROM customers 
                JOIN (SELECT * FROM orders 
                        JOIN (SELECT * FROM orderdetails JOIN products USING (productCode))
                        USING (orderNumber))
                USING (customerNumber)
                ORDER BY orderDate DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = ['contactFirstName', 'contactLastName', 'productName', 'quantityinStock', 'orderDate']
df.head()

,contactFirstName,contactLastName,productName,quantityinStock,orderDate
0,Janine,Labrune,1962 LanciaA Delta 16V,6791,2005-05-31
1,Janine,Labrune,1957 Chevy Pickup,6125,2005-05-31
2,Janine,Labrune,1998 Chrysler Plymouth Prowler,4724,2005-05-31
3,Janine,Labrune,1964 Mercedes Tour Bus,8258,2005-05-31
4,Janine,Labrune,1926 Ford Fire Engine,2018,2005-05-31

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!